//1. Создать пустой проект в IntelliJ IDEA и прописать метод main();
public class task1 {
    public static void main(String[] args) {
        System.out.println("Hello World!");
    }
}